app/views/compras/_form.html.erb

SELECT "almuerzos".* FROM "almuerzos"  ORDER BY "almuerzos"."nombre" ASC
---
  <div class="field">
    <%= f.collection_select  :almuerzo_id,Almuerzo.order(:nombre),:id,:nombre,prompt: "Seleccione Almuerzo"%>