app/controllers/almuerzos_controller.rb

  def index
    @almuerzos = Almuerzo.all
---
SELECT "almuerzos".* FROM "almuerzos"

  def create
    @almuerzo = Almuerzo.new(almuerzo_params)

    respond_to do |format|
      if @almuerzo.save
---
INSERT INTO "almuerzos" ("foto", "nombre", "descripcion", "precio", "stock", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)

  def update
    respond_to do |format|
      if @almuerzo.update(almuerzo_params)
---
UPDATE "almuerzos" SET "descripcion" = ?, "updated_at" = ? WHERE "almuerzos"."id" = ?  [["descripcion", "ensalada surtida, porotos granados, bebida o agua mineral "], ["updated_at", "2017-02-21 07:23:18.475460"], ["id", 1]]

    def set_almuerzo
      @almuerzo = Almuerzo.find(params[:id])
---
SELECT  "almuerzos".* FROM "almuerzos" WHERE "almuerzos"."id" = ? LIMIT 1  [["id", 3]]