app/controllers/compras_controller.rb

  def index
    @compras = Compra.all
---
SELECT "compras".* FROM "compras"

  def create
    @compra = current_user.compras.new(compra_params)

    respond_to do |format|
      if @compra.save
---
INSERT INTO "compras" ("almuerzo_id", "created_at", "updated_at") VALUES (?, ?, ?)  [["almuerzo_id", 2], ["created_at", "2017-03-13 19:16:21.291778"], ["updated_at", "2017-03-13 19:16:21.291778"]]

    def set_compra
      @compra = Compra.find(params[:id])
---
SELECT  "compras".* FROM "compras" WHERE "compras"."id" = ? LIMIT 1  [["id", 1]]