app/controllers/welcome_controller.rb

SELECT "users".* FROM "users"  ORDER BY id, "users"."id" ASC
---
  def usuarios
	@users = User.all.order("id")